---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.HasCustomCircuitPath
source: html/1c6a0476-2aa6-a3dc-b65a-0cdf27456e97.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.HasCustomCircuitPath Property

Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.

## Syntax (C#)
```csharp
public bool HasCustomCircuitPath { get; }
```